In [6]:
import pandas as pd
import numpy as np

In [ ]:
#inner join

In [7]:
df1 = pd.DataFrame({"key": ["A", "B", "C", "D"], "value": np.random.randn(4)})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value": np.random.randn(4)})

In [8]:
pd.merge(df1, df2, on="key")

  key   value_x   value_y
0   B  1.291921 -0.496641
1   D -2.244565  0.433184
2   D -2.244565 -0.221897

In [9]:
indexed_df2 = df2.set_index("key")
pd.merge(df1, indexed_df2, left_on="key", right_index=True)

  key   value_x   value_y
1   B  1.291921 -0.496641
3   D -2.244565  0.433184
3   D -2.244565 -0.221897

In [10]:
#left outer join

In [11]:
pd.merge(df1, df2, on="key", how="left")

  key   value_x   value_y
0   A -0.424548       NaN
1   B  1.291921 -0.496641
2   C -2.043953       NaN
3   D -2.244565  0.433184
4   D -2.244565 -0.221897

In [ ]:
#right join

In [12]:
pd.merge(df1, df2, on="key", how="right")

  key   value_x   value_y
0   B  1.291921 -0.496641
1   D -2.244565  0.433184
2   D -2.244565 -0.221897
3   E       NaN -1.208355

In [ ]:
#full join

In [13]:
pd.merge(df1, df2, on="key", how="outer")

  key   value_x   value_y
0   A -0.424548       NaN
1   B  1.291921 -0.496641
2   C -2.043953       NaN
3   D -2.244565  0.433184
4   D -2.244565 -0.221897
5   E       NaN -1.208355

In [14]:
 df1 = pd.DataFrame({"city": ["Chicago", "San Francisco", "New York City"], "rank": range(1, 4)})
 df2 = pd.DataFrame({"city": ["Chicago", "Boston", "Los Angeles"], "rank": [1, 4, 5]})

In [15]:
pd.concat([df1, df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [16]:
pd.concat([df1, df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5